{
    "general": {
        "name": "Ansgar Lichter"
    },
    "navigation": {
        "intro": "Intro",
        "about": "Über mich",
        "experiences": "Erfahrungen",
        "projects": "Projekte",
        "changeLanguage": "Ändern Sie die Sprache",
        "changeColorMode": "Wechseln Sie zwischen Dark und Light Mode"
    },
    "socialIcon": {
        "github": {
            "linkDescription": "Link zu meinem Github-Profil"
        },
        "xing": {
            "linkDescription": "Link zu meinem Xing-Profil"
        },
        "linkedin": {
            "linkDescription": "Link zu meinem Linkedin-Profil"
        },
        "mailTo": {
            "linkDescription": "Link, um mich per Mail zu kontakieren"
        }
    },
    "intro": {
        "hello": "Hallo, ich bin",
        "jobTitle": "Softwareentwickler SAP EWM",
        "studies": "B. Sc. Wirtschaftsinformatik"
    },
    "about": {
        "title": "Über mich",
        "alt": "Herzlich Wilkommen auf meiner Webseite!",
        "description-1": "Ich bin Ansgar, ein Software Engineer aus Karlsruhe.",
        "description-2": "Nach meinem Abschluss an der Dualen Hochschule Karlsruhe in Wirtschaftsinformatik",
        "description-3": "habe ich begonnen bei SEW-EURODRIVE GmbH & Co KG an vielen interessanten Projekten zu arbeiten.",
        "description-4": "Hier sind einige Technologien, mit denen ich in letzter Zeit gearbeitet habe:",
        "technologies": {
            "ewm": "SAP EWM",
            "ui5": "SAPUI5",
            "abap": "ABAP",
            "js": "JAVA SCRIPT"
        }
    },
    "experiences": {
        "title": "Meine Erfahrungen",
        "education": {
            "studies": {
                "title": "B. Sc. Wirtschaftsinformatik",
                "yearStart": "2017",
                "yearEnd": "2020",
                "organisation": "Duale Hochschule",
                "location": "Karlsruhe, Deutschland",
                "description": "Duales Studium Wirtschaftsinformatik mit der Studienrichtung Software Engineering in Kombination mit Erfahrungen im Entwickeln mit ABAP und SAPUI5 in diversen SAP-Bereichen in den Praxisphasen."
            },
            "abroad": {
                "title": "Auslandsaufenthalt: Einführung von SAP MES",
                "yearStart": "2019",
                "yearEnd": "2019",
                "organisation": "Suzhou Motors Ltd.",
                "location": "Suzhou, China",
                "description": "Produktivnahme von ausgewählten Pilotmaschinen mit SAP MES und anschließendem Support der Mitarbeiter vor Ort. Der nächste Schritt war Analyse der weiteren Fertigungsprozesse, um die Grundlage für die darauffolgenden Rollout-Schritte vorzubereiten."
            }
        },
        "work": {
            "itpa": {
                "title": "Softwareentwickler SAP EWM",
                "yearStart": "2020",
                "yearEnd": "Today",
                "organisation": "SEW Eurodrive",
                "location": "Graben-Neudorf, Deutschland",
                "description": "Mitarbeit in diversen Projekten im Kontext von SAP EWM. Besonders ein Template für manuelle Läger in der Unternehmensgruppe mit SAPUI5-Applikationen im FIORI-Launchpad für die mobile Bedienung durch die Lagermitarbeiter."
            }
        },
        "images": {
            "dhbw": "Duale Hochschule Baden-Württemberg",
            "sew": "SEW EURODRIVE",
            "china": "China"
        }
    },
    "featuredProjects": {
        "title": "Einige Dinge, die ich gebaut habe",
        "featured": "Featured Projekt",
        "funnyFart": {
            "title": "Funny Fart",
            "description": "Funny Fart ist eine native Android App, dessen Funktionalität das Bewerten und Speichern von eigenen Fürzen ist. Dafür nutzt die App eine Formel von Beano Studies. Die Funktionalitäten der App umfassen das Berechnen von Scores von Fürzen, das Speichern von berechneten Scores, die Aufnahme von Audios der Fürze und das Speichern dieser in einer lokalen Datenbank.",
            "android": "Android",
            "java": "Java",
            "mobile": "Native App",
            "formulaAlt": "Diese Seite erklärt die Formel von britischen Wissenschaftern, um zu bestimmen, wie witzig ein Furz ist.",
            "calculateAlt": "Auf dieser Seite ist es möglich mit der Formel von britischen Wissenschaftlern zu berechnen, wie witzig Ihr eigener Furz ist.",
            "resultAlt": "Diese Seite visualisiert den Score, der mit Hilfe der Formel berechnet worden ist!",
            "linkDescription": {
                "googlePlay": "Link zu der App im Google Play Store",
                "github": "Link zum Github Repository"
            }
        },
        "catchTheTrain": {
            "title": "Catch The Train",
            "favoritesAlt": "Favorisierte Haltestellen",
            "stopAlt": "Live-Abfahrtszeiten einer Haltestelle",
            "filterAlt": "Filtern der Linien",
            "description": "Eine mobile App mit dem Ziel die täglichen Reisen mit der Bahn angenehmer zugestalten. In Kombination mit der API der Karlsruher Verkehrsvertriebe visualisiert die App die Live-Abfahrtszeiten an den Haltestellen in und um Karlsruhe. Zusätzlich kann man einzelne Haltstelle favorisieren, um auf diese schnell zugreifen zu können.",
            "flutter": "Flutter",
            "api": "KVV API",
            "dart": "Dart",
            "linkDescription": {
                "github": "Link zum Github Repository"
            }
        },
        "dhbwApp": {
            "title": "DHBW App",
            "description": "Die App der DHBW Karlsruhe wird stetig von Studierenden der Wirtschaftsinformatik weiterentwickelt. Hierbei habe ich in einer 2er-Team generell die verwendeten Frameworks gewartet, sowie die Anzeige des Vorlesungsplans, die Anzeige der Live-Abfahrtszeiten, den Speiseplan und die Übersichtsseite nach Aktualisierungen der dahinter liegenden APIs wieder funktionsfähig gestaltet und den Quellcode gewartet.",
            "mensaAlt": "Diese Seite zeigt den aktuellen Speiseplan der Mensa der Hochschule.",
            "raplaAlt": "Diese Seite visualisiert den Vorlesungsplan für den Kurs, den man in den Einstellungen hinterlegt hat.",
            "overviewAlt": "Diese Seite bietet eine Übersicht über die wichtigsten Aktivitäten: den heutigen Speiseplan, die heutigen Vorlesungen und die nächsten Abfahrten der S-Bahnen an der nächsten Haltestelle.",
            "angular": "Angular",
            "ionic": "Ionic",
            "typeScript": "TypeScript",
            "openMensa": "Open Mensa API",
            "kvvApi": "KVV API",
            "rapla": "Rapla API",
            "linkDescription": {
                "googlePlay": "Link zu der App im Google Play Store",
                "external": "Externer Link auf die Homepage der DHBW App"
            }
        }
    },
    "otherProjects": {
        "title": "Andere nennenswerte Projekte",
        "justDoIt": {
            "title": "Just Do It",
            "description": "Eine serverseitige MVC-Webanwendung zum Management von To-DOs in Java, entwickelt während einer Vorlesung in meinem Studium. Die Anwendung nutzt hierfür die Jakarta Enterprise Edition.",
            "java": "Java",
            "jee": "JEE", 
            "tomEE": "TomEE",
            "derby": "Derby",
            "linkDescription": {
                "github": "Link zum Github Repository"
            }
        },
        "projectInitializationAutomation": {
            "title": "Project Initialization Automation",
            "description": "Eine Konsolen-Anwendung, um den Prozess für ein neues Github-Repository zu vereinfachen. Nach Eingabe des Namens wird automatisch ein Repository auf Github und ein entsprechender lokaler Ordner mit initialer Readme-Datei erstellt. Danach werden die initalen Änderungen committet und gepushed. Der gewünschte lokale Pfad für das Repository und der Token für die GitHub Authentifizierung können über eine Text-Datei konfiguriert werden.",
            "python": "Python",
            "githubAPI": "Github API",
            "linkDescription": {
                "github": "Link zum Github Repository"
            }
        }
    },
    "footer": {
        "imprint": "Impressum",
        "delimiter": " | ",
        "privacyPolicy": "Datenschutzerklärung"
    },
    "imprint": {
        "close": "Schließen",
        "title": "Impressum",
        "domain": {
            "title": "Domaininhaber",
            "name": "Ansgar Lichter",
            "academicTitle": "Wirtschaftsinformatik (B. Sc.)",
            "mail": "E-Mail: lichteransgar{'@'}gmail.com"
        },
        "disputeSettlement": {
            "title": "EU-Streitschlichtung",
            "description": "Die Europäische Kommission stellt eine Plattform zur Online-Streitbeilegung (OS) bereit: https://ec.europa.eu/consumers/odr. Unsere E-Mail-Adresse finden Sie oben im Impressum. Wir sind nicht bereit oder verpflichtet, an Streitbeilegungsverfahren vor einer Verbraucherschlichtungsstelle teilzunehmen."
        },
        "liabilityContent": {
            "title": "Haftung für Inhalte",
            "description": "Als Diensteanbieter sind wir gemäß § 7 Abs.1 TMG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Nach §§ 8 bis 10 TMG sind wir als Diensteanbieter jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werden wir diese Inhalte umgehend entfernen."
        },
        "liabilityLinks": {
            "title": "Haftung für Links",
            "description": "Unser Angebot enthält Links zu externen Websites Dritter, auf deren Inhalte wir keinen Einfluss haben. Deshalb können wir für diese fremden Inhalte auch keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich. Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft. Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar. Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Links umgehend entfernen."
        },
        "copyright": {
            "title": "Urheberrecht",
            "description": "Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen."
        },
        "source": {
            "title": "Quelle",
            "description": "eRecht24",
            "linkDescription": "Link zur Quelle: eRecht24"
        }
    },
    "privacyPolicy": {
        "close": "Schließen",
        "title": "Datenschutzerklärung",
        "overview": {
            "title": "1. Datenschutz auf einen Blick",
            "generalInformation": {
                "title": "Allgemeine Hinweise",
                "description": "Die folgenden Hinweise geben einen einfachen Überblick darüber, was mit Ihren personenbezogenen Daten passiert, wenn Sie unsere Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie persönlich identifiziert werden können. Ausführliche Informationen zum Thema Datenschutz entnehmen Sie unserer unter diesem Text aufgeführten Datenschutzerklärung."
            },
            "dataCollection": {
                "title": "Datenerfassung auf dieser Website",
                "responsiblity": {
                    "title": "Wer ist verantwortlich für die Datenerfassung auf dieser Website?",
                    "description": "Die Datenverarbeitung auf dieser Website erfolgt durch den Websitebetreiber. Dessen Kontaktdatenkönnen Sie dem Abschnitt „Hinweis zur Verantwortlichen Stelle“ in dieser Datenschutzerklärung entnehmen."
                },
                "how": {
                    "title": "Wie erfassen wir Ihre Daten?",
                    "description": "Ihre Daten werden zum einen dadurch erhoben, dass Sie uns diese mitteilen. Hierbei kann es sich z. B. um Daten handeln, die Sie in ein Kontaktformular eingeben. Andere Daten werden automatisch oder nach Ihrer Einwilligung beim Besuch der Website durch unsere IT-Systeme erfasst. Das sind vor allem technische Daten (z. B. Internetbrowser, Betriebssystem oder Uhrzeit des Seitenaufrufs). Die Erfassung dieser Daten erfolgt automatisch, sobald Sie diese Website betreten."
                },
                "use": {
                    "title": "Wofür nutzen wir Ihre Daten?",
                    "description": "Ein Teil der Daten wird erhoben, um eine fehlerfreie Bereitstellung der Website zu gewährleisten. Andere Daten können zur Analyse Ihres Nutzerverhaltens verwendet werden."
                },
                "rights": {
                    "title": "Welche Rechte haben Sie bezüglich Ihrer Daten?",
                    "description": "Sie haben jederzeit das Recht, unentgeltlich Auskunft über Herkunft, Empfänger und Zweck Ihrer gespeicherten personenbezogenen Daten zu erhalten. Sie haben außerdem ein Recht, die Berichtigung oder Löschung dieser Daten zu verlangen. Wenn Sie eine Einwilligung zur Datenverarbeitung erteilt haben, können Sie diese Einwilligung jederzeit für die Zukunft widerrufen. Außerdem haben Sie das Recht, unter bestimmten Umständen die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Des Weiteren steht Ihnen ein Beschwerderecht bei der zuständigen Aufsichtsbehörde zu. Hierzu sowie zu weiteren Fragen zum Thema Datenschutz können Sie sich jederzeit an uns wenden."
                }
            }
        },
        "cdn": {
            "title": "2. Hosting und Content Delivery Networks (CDN)",
            "hosting": {
                "title": "Externes Hosting",
                "description1": "Diese Website wird bei einem externen Dienstleister gehostet (Hoster). Die personenbezogenen Daten, die auf dieser Website erfasst werden, werden auf den Servern des Hosters gespeichert. Hierbei kann es sich v.a. um IP-Adressen, Kontaktanfragen, Meta- und Kommunikationsdaten, Vertragsdaten, Kontaktdaten, Namen, Websitezugriffe und sonstige Daten, die über eine Website generiert werden, handeln. Der Einsatz des Hosters erfolgt zum Zwecke der Vertragserfüllung gegenüber unseren potenziellen und bestehenden Kunden (Art. 6 Abs. 1 lit. b DSGVO) und im Interesse einer sicheren, schnellen und effizienten Bereitstellung unseres Online-Angebots durch einen professionellen Anbieter (Art. 6 Abs. 1 lit. f DSGVO).",
                "description2": "Unser Hoster wird Ihre Daten nur insoweit verarbeiten, wie dies zur Erfüllung seiner Leistungspflichten erforderlich ist und unsere Weisungen in Bezug auf diese Daten befolgen. Wir setzen folgenden Hoster ein:",
                "githubPages": {
                    "name": "GitHub Inc.",
                    "street": "88 Colin P Kelly Jr St",
                    "city": "San Francisco, CA 94107",
                    "country": "United States"
                },
                "cloudflare": {
                    "name": "Cloudflare Germany GmbH",
                    "street": "Rosental 7",
                    "city": "80331 München",
                    "country": "Deutschland"
                }
            },
            "contract": {
                "title": "Abschluss eines Vertrages über Auftragsverarbeitung",
                "description": "Um die datenschutzkonforme Verarbeitung zu gewährleisten, haben wir einen Vertrag über Auftragsverarbeitung mit unserem Hoster geschlossen."
            }
        },
        "general": {
            "title": "3. Allgemeine Hinweise und Pflichtinformationen",
            "protection": {
                "title": "Datenschutz",
                "description1": "Die Betreiber dieser Seiten nehmen den Schutz Ihrer persönlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend der gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung.",
                "description2": "Wenn Sie diese Website benutzen, werden verschiedene personenbezogene Daten erhoben. Personenbezogene Daten sind Daten, mit denen Sie persönlich identifiziert werden können. Die vorliegende Datenschutzerklärung erläutert, welche Daten wir erheben und wofür wir sie nutzen. Sie erläutert auch, wie und zu welchem Zweck das geschieht.",
                "description3": "Wir weisen darauf hin, dass die Datenübertragung im Internet (z. B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich."
            },
            "responsibility": {
                "title": "Hinweis zur verantwortlichen Stelle",
                "description1": "Die verantwortliche Stelle für die Datenverarbeitung auf dieser Website ist:",
                "name": "Ansgar Lichter",
                "mailLabel": "E-Mail: ",
                "mail": "lichteransgar{'@'}gmail.com",
                "description2": "Verantwortliche Stelle ist die natürliche oder juristische Person, die allein oder gemeinsam mit anderen über die Zwecke und Mittel der Verarbeitung von personenbezogenen Daten (z. B. Namen, E-Mail-Adressen o. Ä.) entscheidet.",
                "linkDescription": "Mail an den Verantwortlichen für die Datenschutzerklärung"
            },
            "storagePeriod": {
                "title": "Speicherdauer",
                "description": "Soweit innerhalb dieser Datenschutzerklärung keine speziellere Speicherdauer genannt wurde, verbleiben Ihre personenbezogenen Daten bei uns, bis der Zweck für die Datenverarbeitung entfällt. Wenn Sie ein berechtigtes Löschersuchen geltend machen oder eine Einwilligung zur Datenverarbeitung widerrufen, werden Ihre Daten gelöscht, sofern wir keinen anderen rechtlich zulässigen Gründe für die Speicherung Ihrer personenbezogenen Daten haben (z.B. steuer- oder handelsrechtliche Aufbewahrungsfristen); im letztgenannten Fall erfolgt die Löschung nach Fortfall dieser Gründe."
            },
            "revocation": {
                "title": "Widerruf Ihrer Einwilligung zur Datenverarbeitung",
                "description": "Viele Datenverarbeitungsvorgänge sind nur mit Ihrer ausdrücklichen Einwilligung möglich. Sie können eine bereits erteilte Einwilligung jederzeit widerrufen. Die Rechtmäßigkeit der bis zum Widerruf erfolgten Datenverarbeitung bleibt vom Widerruf unberührt."
            },
            "rightToObject": {
                "title": "Widerspruchsrecht gegen die Datenerhebung in besonderen Fällen sowie gegen Direktwerbung (Art. 21 DSGVO)",
                "description": "WENN DIE DATENVERARBEITUNG AUF GRUNDLAGE VON ART. 6 ABS. 1 LIT. E ODER F DSGVO ERFOLGT, HABEN SIE JEDERZEIT DAS RECHT, AUS GRÜNDEN, DIE SICH AUS IHRER BESONDEREN SITUATION ERGEBEN, GEGEN DIE VERARBEITUNG IHRER PERSONENBEZOGENEN DATEN WIDERSPRUCH EINZULEGEN; DIES GILT AUCH FÜR EIN AUF DIESE BESTIMMUNGEN GESTÜTZTES PROFILING. DIE JEWEILIGE RECHTSGRUNDLAGE, AUF DENEN EINE VERARBEITUNG BERUHT, ENTNEHMEN SIE DIESER DATENSCHUTZERKLÄRUNG. WENN SIE WIDERSPRUCH EINLEGEN, WERDEN WIR IHRE BETROFFENEN PERSONENBEZOGENEN DATEN NICHT MEHR VERARBEITEN, ES SEI DENN, WIR KÖNNEN ZWINGENDE SCHUTZWÜRDIGE GRÜNDE FÜR DIE VERARBEITUNG NACHWEISEN, DIE IHRE INTERESSEN, RECHTE UND FREIHEITEN ÜBERWIEGEN ODER DIE VERARBEITUNG DIENT DER GELTENDMACHUNG, AUSÜBUNG ODER VERTEIDIGUNG VON RECHTSANSPRÜCHEN (WIDERSPRUCH NACH ART. 21 ABS. 1 DSGVO). WERDEN IHRE PERSONENBEZOGENEN DATEN VERARBEITET, UM DIREKTWERBUNG ZU BETREIBEN, SO HABEN SIE DAS RECHT, JEDERZEIT WIDERSPRUCH GEGEN DIE VERARBEITUNG SIE BETREFFENDER PERSONENBEZOGENER DATEN ZUM ZWECKE DERARTIGER WERBUNG EINZULEGEN; DIES GILT AUCH FÜR DAS PROFILING, SOWEIT ES MIT SOLCHER DIREKTWERBUNG IN VERBINDUNG STEHT. WENN SIE WIDERSPRECHEN, WERDEN IHRE PERSONENBEZOGENEN DATEN ANSCHLIESSEND NICHT MEHR ZUM ZWECKE DER DIREKTWERBUNG VERWENDET (WIDERSPRUCH NACH ART. 21 ABS. 2 DSGVO)."
            },
            "rightToComplain": {
                "title": "Beschwerderecht bei der zuständigen Aufsichtsbehörde",
                "description": "Im Falle von Verstößen gegen die DSGVO steht den Betroffenen ein Beschwerderecht bei einer Aufsichtsbehörde, insbesondere in dem Mitgliedstaat ihres gewöhnlichen Aufenthalts, ihres Arbeitsplatzes oder des Orts des mutmaßlichen Verstoßes zu. Das Beschwerderecht besteht unbeschadet anderweitiger verwaltungsrechtlicher oder gerichtlicher Rechtsbehelfe."
            },
            "dataPortability": {
                "title": "Recht auf Datenübertragbarkeit",
                "description": "Sie haben das Recht, Daten, die wir auf Grundlage Ihrer Einwilligung oder in Erfüllung eines Vertrags automatisiert verarbeiten, an sich oder an einen Dritten in einem gängigen, maschinenlesbaren Format aushändigen zu lassen. Sofern Sie die direkte Übertragung der Daten an einen anderen Verantwortlichen verlangen, erfolgt dies nur, soweit es technisch machbar ist."
            },
            "encryption": {
                "title": "SSL- bzw. TLS-Verschlüsselung",
                "description": "Diese Seite nutzt aus Sicherheitsgründen und zum Schutz der Übertragung vertraulicher Inhalte, wie zum Beispiel Bestellungen oder Anfragen, die Sie an uns als Seitenbetreiber senden, eine SSL- bzw. TLS-Verschlüsselung. Eine verschlüsselte Verbindung erkennen Sie daran, dass die Adresszeile des Browsers von „http://“ auf „https://“ wechselt und an dem Schloss-Symbol in Ihrer Browserzeile. Wenn die SSL- bzw. TLS-Verschlüsselung aktiviert ist, können die Daten, die Sie an uns übermitteln, nicht von Dritten mitgelesen werden."
            },
            "protectionRights": {
                "title": "Auskunft, Löschung und Berichtigung",
                "description": "Sie haben im Rahmen der geltenden gesetzlichen Bestimmungen jederzeit das Recht auf unentgeltliche Auskunft über Ihre gespeicherten personenbezogenen Daten, deren Herkunft und Empfänger und den Zweck der Datenverarbeitung und ggf. ein Recht auf Berichtigung oder Löschung dieser Daten. Hierzu sowie zu weiteren Fragen zum Thema personenbezogene Daten können Sie sich jederzeit an uns wenden."
            },
            "restrictionOfProcessing": {
                "title": "Recht auf Einschränkung der Verarbeitung",
                "description1": "Sie haben das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Hierzu können Sie sich jederzeit an uns wenden. Das Recht auf Einschränkung der Verarbeitung besteht in folgenden Fällen:",
                "description2": "Wenn Sie die Richtigkeit Ihrer bei uns gespeicherten personenbezogenen Daten bestreiten, benötigen wir in der Regel Zeit, um dies zu überprüfen. Für die Dauer der Prüfung haben Sie das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. ",
                "description3": "Wenn die Verarbeitung Ihrer personenbezogenen Daten unrechtmäßig geschah/geschieht, können Sie statt der Löschung die Einschränkung der Datenverarbeitung verlangen.",
                "description4": "Wenn wir Ihre personenbezogenen Daten nicht mehr benötigen, Sie sie jedoch zur Ausübung, Verteidigung oder Geltendmachung von Rechtsansprüchen benötigen, haben Sie das Recht, statt der Löschung die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.",
                "description5": "Wenn Sie einen Widerspruch nach Art. 21 Abs. 1 DSGVO eingelegt haben, muss eine Abwägung zwischen Ihren und unseren Interessen vorgenommen werden. Solange noch nicht feststeht, wessen Interessen überwiegen, haben Sie das Recht, die Einschränkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.",
                "description6": "Wenn Sie die Verarbeitung Ihrer personenbezogenen Daten eingeschränkt haben, dürfen diese Daten – von ihrer Speicherung abgesehen – nur mit Ihrer Einwilligung oder zur Geltendmachung, Ausübung oder Verteidigung von Rechtsansprüchen oder zum Schutz der Rechte einer anderen natürlichen oder juristischen Person oder aus Gründen eines wichtigen öffentlichen Interesses der Europäischen Union oder eines Mitgliedstaats verarbeitet werden."
            }
        },
        "dataAquistion": {
            "title": "4. Datenerfassung auf dieser Website",
            "logs": {
                "title": "Server-Log-Dateien",
                "description": "Der Provider der Seiten erhebt und speichert automatisch Informationen in so genannten Server-Log-Dateien, die Ihr Browser automatisch an uns übermittelt. Dies sind:",
                "list1": "Browsertyp und Browserversion",
                "list2": "Verwendetes Betriebssystem",
                "list3": "Referrer URL",
                "list4": "Hostname des zugreifenden Rechners",
                "list5": "Uhrzeit der Serveranfrage",
                "list6": "IP-Adresse",
                "description2": "Eine Zusammenführung dieser Daten mit anderen Datenquellen wird nicht vorgenommen. Die Erfassung dieser Daten erfolgt auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO. Der Websitebetreiber hat ein berechtigtes Interesse an der technisch fehlerfreien Darstellung und der Optimierung seiner Website – hierzu müssen die Server-Log-Files erfasst werden."
            }
        },
        "plugins": {
            "title": "5. Plugins und Tools",
            "fontAwesome": {
                "title": "Font Awesome (lokales Hosting)",
                "description": "Diese Seite nutzt zur einheitlichen Darstellung von Schriftarten Font Awesome. Font Awesome ist lokal installiert. Eine Verbindung zu Servern von Fonticons, Inc. findet dabei nicht statt. Weitere Informationen zu Font Awesome finden Sie in der",
                "description2": "Datenschutzerklärung",
                "description3": "für Font Awesome.",
                "linkDescription": "Link zu FontAwesome"
            }
        },
        "source": {
            "title": "Quelle",
            "description": "eRecht24",
            "linkDescription": "Link zur Quelle: eRecht24"
        }
    }
}